app/controllers/articles_controller.rb

	def create
		@article = Article.new(article_params)
		@article.save
---
INSERT INTO "articles" ("created_at", "title", "updated_at") VALUES (?, ?, ?)  [["created_at", Mon, 27 Oct 2014 01:49:18 UTC +00:00], ["title", "asdf"], ["updated_at", Mon, 27 Oct 2014 01:49:18 UTC +00:00]]

	def update
		@article = Article.find(params[:id])
		@article.update(article_params)
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "articles" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "articles"."id" = 12  [["title", "Is Ice Cream Healthy for you?"], ["body", "is it?"], ["updated_at", Mon, 27 Oct 2014 03:54:07 UTC +00:00]]