app/controllers/comments_controller.rb

	def create
		@comment = Comment.new(comment_params)
		@comment.article_id = params[:article_id]

		@comment.save
---
INSERT INTO "comments" ("article_id", "author_name", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["article_id", 1], ["author_name", "Minsoo"], ["body", "What?"], ["created_at", Mon, 27 Oct 2014 04:51:53 UTC +00:00], ["updated_at", Mon, 27 Oct 2014 04:51:53 UTC +00:00]]